<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","label":"management","backend":"d663e87b966175cfb0d2af969ddcb9d1c37cfd450d259a04b5011352845bda03","plan_job_ref":"Job PR-PLAN #19 at https://github.com/Workquark/Terraform/actions/runs/14151812826","plan_out_hash":"c317a25b98f88d11bcdb03cfb1d5418b78d77e43323b0b8ff0d77e4c244c09f9","plan_hash":"8f9fb88d4f4bcf39a607c1e5ede5a766286e59b54c77ad4eafc5f1e692c30476","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan for __management__
<details>
<summary>Plan: 5 to add, 0 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_client_config.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_client_config" "default" {
+       access_token   = (sensitive value)
+       default_labels = (known after apply)
+       id             = (known after apply)
+       project        = (known after apply)
+       region         = (known after apply)
+       zone           = (known after apply)
    }

  # module.gke_dev.data.google_client_config.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_client_config" "default" {
+       access_token   = (sensitive value)
+       default_labels = (known after apply)
+       id             = (known after apply)
+       project        = (known after apply)
+       region         = (known after apply)
+       zone           = (known after apply)
    }

  # module.twingate.google_compute_instance.twingate[0] must be replaced
-/+ resource "google_compute_instance" "twingate" {
!~      cpu_platform               = "Intel Broadwell" -> (known after apply)
!~      creation_timestamp         = "2025-03-29T19:13:05.082-07:00" -> (known after apply)
!~      current_status             = "RUNNING" -> (known after apply)
-       enable_display             = false -> null
!~      id                         = "***********************************************************************************************" -> (known after apply)
!~      instance_id                = "*******************" -> (known after apply)
!~      label_fingerprint          = "BM7v74rVbxA=" -> (known after apply)
-       labels                     = {} -> null
!~      metadata_fingerprint       = "km5vjCNteJ8=" -> (known after apply)
+       min_cpu_platform           = (known after apply)
        name                       = "jrc-online-management-twingate-0"
-       resource_policies          = [] -> null
!~      self_link                  = "https://www.googleapis.com/compute/v1/projects/concise-mesh-453415-t8/zones/europe-west1-b/instances/jrc-online-management-twingate-0" -> (known after apply)
-       tags                       = [] -> null
!~      tags_fingerprint           = "42WmSpB8rSM=" -> (known after apply)
#        (13 unchanged attributes hidden)

!~      boot_disk {
!~          device_name                = "persistent-disk-0" -> (known after apply)
+           disk_encryption_key_sha256 = (known after apply)
!~          guest_os_features          = [
-               "IDPF",
-               "SEV_LIVE_MIGRATABLE",
-               "GVNIC",
-               "SEV_CAPABLE",
-               "SEV_LIVE_MIGRATABLE_V2",
-               "UEFI_COMPATIBLE",
-               "SEV_SNP_CAPABLE",
-               "TDX_CAPABLE",
-               "VIRTIO_SCSI_MULTIQUEUE",
            ] -> (known after apply)
+           kms_key_self_link          = (known after apply)
!~          source                     = "https://www.googleapis.com/compute/v1/projects/concise-mesh-453415-t8/zones/europe-west1-b/disks/jrc-online-management-twingate-0" -> (known after apply)
#            (4 unchanged attributes hidden)

!~          initialize_params {
!~              architecture                = "X86_64" -> (known after apply)
-               enable_confidential_compute = false -> null
!~              image                       = "https://www.googleapis.com/compute/v1/projects/cos-cloud/global/images/cos-stable-117-18613-164-93" -> (known after apply) # forces replacement
!~              labels                      = {} -> (known after apply)
!~              provisioned_iops            = 0 -> (known after apply)
!~              provisioned_throughput      = 0 -> (known after apply)
-               resource_manager_tags       = {} -> null
!~              resource_policies           = [] -> (known after apply)
!~              size                        = 10 -> (known after apply)
!~              type                        = "pd-standard" -> (known after apply)
#                (1 unchanged attribute hidden)
            }
        }

!~      confidential_instance_config (known after apply)

!~      guest_accelerator (known after apply)

!~      network_interface {
!~          internal_ipv6_prefix_length = 0 -> (known after apply)
+           ipv6_access_type            = (known after apply)
+           ipv6_address                = (known after apply)
!~          name                        = "nic0" -> (known after apply)
!~          network                     = "https://www.googleapis.com/compute/v1/projects/concise-mesh-453415-t8/global/networks/jrc-online-management-vpc-network" -> (known after apply)
+           network_attachment          = (known after apply)
!~          network_ip                  = "10.80.21.245" -> (known after apply)
-           queue_count                 = 0 -> null
!~          stack_type                  = "IPV4_ONLY" -> (known after apply)
!~          subnetwork                  = "https://www.googleapis.com/compute/v1/projects/concise-mesh-453415-t8/regions/europe-west1/subnetworks/ops-management-subnet-1" -> "ops-management-subnet-1"
#            (2 unchanged attributes hidden)
        }

!~      reservation_affinity (known after apply)

!~      scheduling (known after apply)
-       scheduling {
-           automatic_restart           = true -> null
-           availability_domain         = 0 -> null
-           min_node_cpus               = 0 -> null
-           on_host_maintenance         = "MIGRATE" -> null
-           preemptible                 = false -> null
-           provisioning_model          = "STANDARD" -> null
#            (2 unchanged attributes hidden)
        }

#        (1 unchanged block hidden)
    }

  # module.twingate.google_compute_instance.twingate[1] must be replaced
-/+ resource "google_compute_instance" "twingate" {
!~      cpu_platform               = "Intel Broadwell" -> (known after apply)
!~      creation_timestamp         = "2025-03-29T19:13:04.682-07:00" -> (known after apply)
!~      current_status             = "RUNNING" -> (known after apply)
-       enable_display             = false -> null
!~      id                         = "***********************************************************************************************" -> (known after apply)
!~      instance_id                = "*******************" -> (known after apply)
!~      label_fingerprint          = "BM7v74rVbxA=" -> (known after apply)
-       labels                     = {} -> null
!~      metadata_fingerprint       = "avBcKkUh7Jo=" -> (known after apply)
+       min_cpu_platform           = (known after apply)
        name                       = "jrc-online-management-twingate-1"
-       resource_policies          = [] -> null
!~      self_link                  = "https://www.googleapis.com/compute/v1/projects/concise-mesh-453415-t8/zones/europe-west1-b/instances/jrc-online-management-twingate-1" -> (known after apply)
-       tags                       = [] -> null
!~      tags_fingerprint           = "42WmSpB8rSM=" -> (known after apply)
#        (13 unchanged attributes hidden)

!~      boot_disk {
!~          device_name                = "persistent-disk-0" -> (known after apply)
+           disk_encryption_key_sha256 = (known after apply)
!~          guest_os_features          = [
-               "IDPF",
-               "SEV_LIVE_MIGRATABLE",
-               "GVNIC",
-               "SEV_CAPABLE",
-               "SEV_LIVE_MIGRATABLE_V2",
-               "UEFI_COMPATIBLE",
-               "SEV_SNP_CAPABLE",
-               "TDX_CAPABLE",
-               "VIRTIO_SCSI_MULTIQUEUE",
            ] -> (known after apply)
+           kms_key_self_link          = (known after apply)
!~          source                     = "https://www.googleapis.com/compute/v1/projects/concise-mesh-453415-t8/zones/europe-west1-b/disks/jrc-online-management-twingate-1" -> (known after apply)
#            (4 unchanged attributes hidden)

!~          initialize_params {
!~              architecture                = "X86_64" -> (known after apply)
-               enable_confidential_compute = false -> null
!~              image                       = "https://www.googleapis.com/compute/v1/projects/cos-cloud/global/images/cos-stable-117-18613-164-93" -> (known after apply) # forces replacement
!~              labels                      = {} -> (known after apply)
!~              provisioned_iops            = 0 -> (known after apply)
!~              provisioned_throughput      = 0 -> (known after apply)
-               resource_manager_tags       = {} -> null
!~              resource_policies           = [] -> (known after apply)
!~              size                        = 10 -> (known after apply)
!~              type                        = "pd-standard" -> (known after apply)
#                (1 unchanged attribute hidden)
            }
        }

!~      confidential_instance_config (known after apply)

!~      guest_accelerator (known after apply)

!~      network_interface {
!~          internal_ipv6_prefix_length = 0 -> (known after apply)
+           ipv6_access_type            = (known after apply)
+           ipv6_address                = (known after apply)
!~          name                        = "nic0" -> (known after apply)
!~          network                     = "https://www.googleapis.com/compute/v1/projects/concise-mesh-453415-t8/global/networks/jrc-online-management-vpc-network" -> (known after apply)
+           network_attachment          = (known after apply)
!~          network_ip                  = "10.80.21.244" -> (known after apply)
-           queue_count                 = 0 -> null
!~          stack_type                  = "IPV4_ONLY" -> (known after apply)
!~          subnetwork                  = "https://www.googleapis.com/compute/v1/projects/concise-mesh-453415-t8/regions/europe-west1/subnetworks/ops-management-subnet-1" -> "ops-management-subnet-1"
#            (2 unchanged attributes hidden)
        }

!~      reservation_affinity (known after apply)

!~      scheduling (known after apply)
-       scheduling {
-           automatic_restart           = true -> null
-           availability_domain         = 0 -> null
-           min_node_cpus               = 0 -> null
-           on_host_maintenance         = "MIGRATE" -> null
-           preemptible                 = false -> null
-           provisioning_model          = "STANDARD" -> null
#            (2 unchanged attributes hidden)
        }

#        (1 unchanged block hidden)
    }

  # module.base.module.dns_zones_iam_binding.google_dns_managed_zone_iam_member.dns_zone_iam_additive["default--roles/dns.admin--serviceAccount:cert-manager@concise-mesh-453415-t8.iam.gserviceaccount.com"] will be created
+   resource "google_dns_managed_zone_iam_member" "dns_zone_iam_additive" {
+       etag         = (known after apply)
+       id           = (known after apply)
+       managed_zone = "druidsoft-in"
+       member       = "serviceAccount:cert-manager@concise-mesh-453415-t8.iam.gserviceaccount.com"
+       project      = "concise-mesh-453415-t8"
+       role         = "roles/dns.admin"
    }

  # module.base.module.dns_zones_iam_binding.google_dns_managed_zone_iam_member.dns_zone_iam_additive["default--roles/dns.admin--serviceAccount:external-dns@concise-mesh-453415-t8.iam.gserviceaccount.com"] will be created
+   resource "google_dns_managed_zone_iam_member" "dns_zone_iam_additive" {
+       etag         = (known after apply)
+       id           = (known after apply)
+       managed_zone = "druidsoft-in"
+       member       = "serviceAccount:external-dns@concise-mesh-453415-t8.iam.gserviceaccount.com"
+       project      = "concise-mesh-453415-t8"
+       role         = "roles/dns.admin"
    }

  # module.gke_dev.module.gke.data.google_compute_zones.available[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_compute_zones" "available" {
+       id      = (known after apply)
+       names   = (known after apply)
+       project = "concise-mesh-453415-t8"
+       region  = "europe-west1"
    }

  # module.gke_dev.module.gke.data.google_container_engine_versions.region will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "region" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "europe-west1"
+       project                         = "concise-mesh-453415-t8"
+       release_channel_default_version = (known after apply)
+       release_channel_latest_version  = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke_dev.module.gke.data.google_container_engine_versions.zone will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_engine_versions" "zone" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = (known after apply)
+       project                         = "concise-mesh-453415-t8"
+       release_channel_default_version = (known after apply)
+       release_channel_latest_version  = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke_dev.module.gke.random_shuffle.available_zones[0] must be replaced
-/+ resource "random_shuffle" "available_zones" {
!~      id           = "*" -> (known after apply)
!~      input        = [
-           "europe-west1-b",
-           "europe-west1-c",
-           "europe-west1-d",
        ] -> (known after apply) # forces replacement
!~      result       = [
-           "europe-west1-d",
-           "europe-west1-b",
-           "europe-west1-c",
        ] -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # module.twingate.module.container[0].data.google_compute_image.coreos will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_compute_image" "coreos" {
+       archive_size_bytes                = (known after apply)
+       creation_timestamp                = (known after apply)
+       description                       = (known after apply)
+       disk_size_gb                      = (known after apply)
+       family                            = "cos-stable"
+       id                                = (known after apply)
+       image_encryption_key_sha256       = (known after apply)
+       image_id                          = (known after apply)
+       label_fingerprint                 = (known after apply)
+       labels                            = (known after apply)
+       licenses                          = (known after apply)
+       name                              = (known after apply)
+       project                           = "cos-cloud"
+       self_link                         = (known after apply)
+       source_disk                       = (known after apply)
+       source_disk_encryption_key_sha256 = (known after apply)
+       source_disk_id                    = (known after apply)
+       source_image_id                   = (known after apply)
+       status                            = (known after apply)
    }

  # module.twingate.module.container[1].data.google_compute_image.coreos will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_compute_image" "coreos" {
+       archive_size_bytes                = (known after apply)
+       creation_timestamp                = (known after apply)
+       description                       = (known after apply)
+       disk_size_gb                      = (known after apply)
+       family                            = "cos-stable"
+       id                                = (known after apply)
+       image_encryption_key_sha256       = (known after apply)
+       image_id                          = (known after apply)
+       label_fingerprint                 = (known after apply)
+       labels                            = (known after apply)
+       licenses                          = (known after apply)
+       name                              = (known after apply)
+       project                           = "cos-cloud"
+       self_link                         = (known after apply)
+       source_disk                       = (known after apply)
+       source_disk_encryption_key_sha256 = (known after apply)
+       source_disk_id                    = (known after apply)
+       source_image_id                   = (known after apply)
+       status                            = (known after apply)
    }

Plan: 5 to add, 0 to change, 3 to destroy.

Warning: Available Write-only Attribute Alternative

  with module.base.module.secret-manager.google_secret_manager_secret_version.secret-version,
  on /tmp/terraform-data-dir/modules/base.secret-manager/main.tf line 96, in resource "google_secret_manager_secret_version" "secret-version":
  96:   secret_data = each.value.secret_data

The attribute secret_data has a write-only alternative secret_data_wo
available. Use the write-only alternative of the attribute when possible.

(and one more similar warning elsewhere)
```
</details>

:memo: Plan generated in [PR-PLAN #19](https://github.com/Workquark/Terraform/actions/runs/14151812826)